---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidSpareSpace
source: html/171a9fb5-cfd3-002d-d6b1-d677e49212b5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.InvalidSpareSpace Property

The number of poles for a spare/space in a single phase, [wire] wires panel cannot exceed [value].

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSpareSpace { get; }
```